Show / Hide Table of Contents
Class ConcreteCheckResultBase
Concrete result base class
Inheritance
System.Object
ConcreteCheckResultBase
ConcreteCheckDetailing
ConcreteSLSCheckResultCrackWidth
ConcreteSLSCheckResultStiffness
ConcreteSLSCheckResultStressLimitation
ConcreteULSCheckResultDiagramCapacity
ConcreteULSCheckResultFatigue
ConcreteULSCheckResultInteraction
ConcreteULSCheckResultResponse
ConcreteULSCheckResultShear
ConcreteULSCheckResultTorsion
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ConcreteCheckResultBase
Constructors
Improve this Doc   View Source
ConcreteCheckResultBase()
Constructor
Declaration
protected ConcreteCheckResultBase()
Properties
Improve this Doc   View Source
Check
settings of check type
Declaration
public CalculationType Check { get; set; }
Property Value
 Type |  Description
 CalculationType
Improve this Doc   View Source
CheckValue
calculated limited value, calculated as strain to limit strain
Declaration
public double CheckValue { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
InternalFores
internal forces used for calculation
Declaration
public ResultOfInternalForces InternalFores { get; set; }
Property Value
 Type |  Description
 ResultOfInternalForces
Improve this Doc   View Source
LimitCheckValue
limit check value for result check
Declaration
public double LimitCheckValue { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
NonConformities
Returns nonconformity in section
Declaration
public List<NonConformity> NonConformities { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<NonConformity>
Improve this Doc   View Source
Result
check result passed/failed
Declaration
public CheckResult Result { get; set; }
Property Value
 Type |  Description
 CheckResult
 Improve this Doc
 View Source